app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES('Home & Family', '2009-05-18 09:18:39', '2009-05-18 09:18:39')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".id FROM "categories" WHERE ("categories"."category" = 'FugaFuga' AND "categories".id <> 6) LIMIT 1
UPDATE "categories" SET "updated_at" = '2009-05-18 09:30:07', "category" = 'FugaFuga' WHERE "id" = 6