app/controllers/items_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 2)
---
  def index
    case params[:order]
    when 'priority'
      @items = Item.find(:all, :order => 'priority,due_date')
    when 'description'
      @items = Item.find(:all, :order => 'description,due_date')
    when 'category'
      @items = Item.find(:all, :include => 'category', :order => 'categories.category,due_date')

SELECT * FROM "items" WHERE ("items"."id" = 2)
---
  def edit
    @categories = Category.find(:all)
    @item = Item.find(params[:id])

INSERT INTO "items" ("note_id", "created_at", "private", "updated_at", "done", "priority", "category_id", "due_date", "description") VALUES(NULL, '2009-05-22 06:17:42', 'f', '2009-05-22 06:17:42', 'f', 3, 2, '2009-05-22', 'call munetaka-san')
SELECT "categories".id FROM "categories" WHERE ("categories"."category" = 'Business' AND "categories".id <> 2) LIMIT 1
---
  def create
    begin
      @item = Item.new(params[:item])
      if @item.save
        respond_to do |format|
          flash[:notice] = 'Item was successfully created.'
          format.html { redirect_to(items_url) }
          format.xml  { render :xml => @item, :status => :created, :location => @item }
        end
      else
        railse
      end
    rescue
      respond_to do |format|
        flash[:notice] = 'Item could not be saved.'
        @categories = Category.find(:all)

SELECT * FROM "items" WHERE ("items"."id" = 1)
UPDATE "items" SET "updated_at" = '2009-05-22 09:58:30', "done" = 't' WHERE "id" = 1
SELECT "categories".id FROM "categories" WHERE ("categories"."category" = 'Business' AND "categories".id <> 2) LIMIT 1
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
        flash[:notice] = 'Item was successfully updated.'
        format.html { redirect_to(items_url) }
        format.xml  { head :ok }
      else
        @categories = Category.find(:all)

DELETE FROM "items" WHERE "id" = 1
---
  def purge_completed
    Item.destroy_all "done = 't'"

SELECT * FROM "items" WHERE ("items"."id" = 6)
UPDATE "items" SET "updated_at" = '2009-05-25 05:56:07', "done" = 'f' WHERE "id" = 3
---
  def updater
    params[:item].each do |item_id, attr|
      item = Item.find(item_id)
      if item.done != eval(attr[:done])
        item.update_attribute(:done,attr[:done])