app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT * FROM "notes"

  def show
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def edit
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
        flash[:notice] = 'Note was successfully created.'
        @item = Item.find(session[:item_id])
        @item.update_attribute(:note_id, @note.id)
---
INSERT INTO "notes" ("created_at", "updated_at", "more_notes") VALUES('2009-05-22 06:40:26', '2009-05-22 06:40:26', 'hoge')
SELECT * FROM "items" WHERE ("items"."id" = 4)
UPDATE "items" SET "updated_at" = '2009-05-22 09:40:55', "note_id" = 5 WHERE "id" = 4

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT * FROM "notes" WHERE ("notes"."id" = 6)
DELETE FROM "notes" WHERE "id" = 6